MESSAGE_4_USERNAME_IS_INCORRECT = "فرمت نام کاربری به درستی انتخاب نشده است.\n" \
                                  "نام کاریری بایستی بین سه تا بیست کاراکتر از کاراکترهای زیر باشد.\n" \
                                  "کاراکترها مجاز عبارتند از:\n" \
                                  "- تمام حروف کوچک انگلیسی\n" \
                                  "- تمام حروف بزرگ انگلیسی\n" \
                                  "- تمام اعداد انگلیسی\n" \
                                  "- کاراکترهای ! @ # $ & * _ .\n"

MESSAGE_4_PHONENUMBER_IS_INCORRECT = "فرمت شماره تلفن همراه به درستی وارد نشده است.\n" \
                                     "شما برای وارد کردن شماره تلفن درست بایستی نکات زیر را در نظر بگیرید:\n" \
                                     "- شماره تلفن همراه بایستی با اعداد انگلیسی وارد شود.\n" \
                                     "- شماره تلفن شما بایستی به صورت یکی از سه فرمت؛" \
                                     " 09123456789 یا 9123456789 یا 989123456789+ وارد شود."

MESSAGE_4_EMAIL_IS_INCORRECT = "فرمت ایمیل به درستی وارد نشده است."

MESSAGE_4_AT_LEAST_THESE_FIELDS = "شما برای ثبت نام در این سامانه نیاز دارید حداقل یکی از فیلدهای؛" \
                                  " نام کاربری، شماره تلفن همراه و یا ایمیل، را در فیلد مربوط به آن وارد کنید."

MESSAGE_4_USERNAME_FIELD_IS_EMPTY = 'فیلد مربوط به نام کاربری- نام کاربری یا شماره تلفن ویا ایمیل- خالی است.'

MESSAGE_4_YOU_HAVE_BEEN_LOGGED_IN_BEFORE = 'شما در حال حاظر ورود کرده اید.'

MESSAGE_4_THERE_IS_NO_USER_WITH_THIS_PROFILE = 'کاربری با این مشخصات وجود ندارد.'

MESSAGE_4_USER_LOGIN_SUCCESSFUL = 'ورود کاربر با موفقیت صورت گرفت.'

MESSAGE_4_USER_LOGOUT_SUCCESSFUL = 'خروج با موفقیت صورت گرفت.'

MESSAGE_4_PASSWORD_FIELD_IS_EMPTY = "فیلد مربوط به کلمه عبور خالی است."

MESSAGE_4_PASSWORD_IS_INCORRECT = "فرمت کلمه عبور به درستی انتخاب نشده است.\n" \
                                  "کلمه عبور بایستی بین هشت تا بیست کاراکتر از کاراکترهای زیر باشد.\n" \
                                  "کاراکترها مجاز عبارتند از:\n" \
                                  "- تمام حروف کوچک انگلیسی\n" \
                                  "- تمام حروف بزرگ انگلیسی\n" \
                                  "- تمام اعداد انگلیسی\n" \
                                  "- کاراکترهای ! @ # $ & * _ .\n"

MESSAGE_4_USER_SIGNUP_SUCCESSFUL = 'ثبت نام کاربر با موفقیت انجام شد.'
MESSAGE_4_USER_IS_EXIST = 'کاربر با این مشخصات قبلا ثبت نام نموده است.'

MESSAGE_4_USER_UPDATE_SUCCESSFUL = 'بروزرسانی اطلاعات کاربر با موفقیت انجام شد.'

MESSAGE_4_NATIONALCODE_IS_INCORRECT = 'کد ملی وارد شده صحیح نمی باشد.'

MESSAGE_4_CANDIDATE_IS_EXIST = 'شما قبلا نامزد شده اید.'

MESSAGE_4_PHONE_NUMBER_FIELD_IS_EMPTY = 'فیلد مربوط به شماره تلفن خالی است.'

MESSAGE_4_EMAIL_FIELD_IS_EMPTY = 'فیلد مربوط به ایمیل خالی است.'

MESSAGE_4_AVATAR_IS_EMPTY = 'فیلد مربوط به ایمیل خالی است.'

YOUR_PROFILE_INFORMATION_IS_INCOMPLETE = "اطلاعات پروفایل شما ناقص است." \
                                         "لطفا پس از مطالعه راهنمای مربوط به ثبت نام به عنوان نامزد انتخاباتی و" \
                                         " تکمیل پروفایل خود، دوباره برای نامزد شدن اقدام نمایید."

MESSAGE_4_YOU_CANDIDATE = 'شما برای نامزدی در انتخابات شرایط اولیه حضور را دارا می باشید.'
